Additional files/BE_suitescript/FedEx Rate Request V1.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v22="http://fedex.com/ws/rate/v22">
	<soapenv:Header/>
	<soapenv:Body>
		<v22:RateRequest>
			<v22:WebAuthenticationDetail>
				<v22:UserCredential>
					<v22:Key>{{key}}</v22:Key>
					<v22:Password>{{password}}</v22:Password>
				</v22:UserCredential>
			</v22:WebAuthenticationDetail>
			
			<v22:ClientDetail>
				<v22:AccountNumber>{{accountnumber}}</v22:AccountNumber>
				<v22:MeterNumber>{{meternumber}}</v22:MeterNumber>
			</v22:ClientDetail>
			<v22:TransactionDetail>
				<v22:CustomerTransactionId>Rate Request</v22:CustomerTransactionId>
			</v22:TransactionDetail>
			
			<v22:Version>
				<v22:ServiceId>crs</v22:ServiceId>
				<v22:Major>22</v22:Major>
				<v22:Intermediate>0</v22:Intermediate>
				<v22:Minor>0</v22:Minor>
			</v22:Version>
			
			<v22:ReturnTransitAndCommit>true</v22:ReturnTransitAndCommit>
 
			<v22:VariableOptions>SATURDAY_DELIVERY</v22:VariableOptions>
		 
			<v22:RequestedShipment>
				<v22:ShipTimestamp>{{shiptimestamp}}</v22:ShipTimestamp>
				<v22:DropoffType>REGULAR_PICKUP</v22:DropoffType>
				<v22:PackagingType>YOUR_PACKAGING</v22:PackagingType>
				
				<v22:Shipper>
					<v22:Address>
						<v22:StateOrProvinceCode>CA</v22:StateOrProvinceCode>
						<v22:PostalCode>94108</v22:PostalCode>
						<v22:CountryCode>US</v22:CountryCode>
					</v22:Address>
				</v22:Shipper>
				
				<v22:Recipient>
					<v22:Address>
						<v22:StateOrProvinceCode>{{ship_state}}</v22:StateOrProvinceCode>
						<v22:PostalCode>{{ship_zipcode}}</v22:PostalCode>
						<v22:CountryCode>{{ship_country}}</v22:CountryCode>
						<v22:Residential>false</v22:Residential>
					</v22:Address>
				</v22:Recipient>
    
				<v22:PackageCount>1</v22:PackageCount>
				<v22:RequestedPackageLineItems>
					<v22:GroupPackageCount>1</v22:GroupPackageCount>
					<v22:Weight>
						<v22:Units>LB</v22:Units>
						<v22:Value>2.0</v22:Value>
					</v22:Weight>
				</v22:RequestedPackageLineItems>
			</v22:RequestedShipment>
		</v22:RateRequest>
	</soapenv:Body>
</soapenv:Envelope>


